[
    {
        "topic": "Business",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "To optimize our 비즈니스 strategy, we need to analyze the 시장 trends and adjust our approach accordingly."
            ],
            "gpt-4.1-nano": [
                "We need to review the quarterly 보고서 before the meeting to ensure everything is accurate."
            ],
            "gpt-4.1-mini": [
                "We need to finalize the 계약 by tomorrow to secure the 투자 and move forward with the 프로젝트."
            ],
            "claude-3.7-sonnet": [
                "During our monthly 회의 (meeting), the CEO announced a new 사업 (business) partnership that will help us expand into the Asian market. The 계약 (contract) includes favorable terms that will significantly boost our 수익 (profit) in the coming fiscal year."
            ]
        }
    },
    {
        "topic": "Business",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "우리 회사의 marketing 전략을 개선해야 해요. 최근 trends를 분석해보니까 새로운 기회를 발견할 수 있을 것 같아요."
            ],
            "gpt-4.1-nano": [
                "이번 미팅에서 중요한 것은 우리의 전략이 market trend와 잘 align하는지 확인하는 거예요."
            ],
            "gpt-4.1-mini": [
                "이번 분기 매출을 높이려면 marketing 전략을 좀 더 강화할 필요가 있어요.  \n팀원들과 함께 새로운 product launch 아이디어도 brainstorm 해봅시다."
            ],
            "claude-3.7-sonnet": [
                "오늘 marketing 팀과 meeting을 진행했는데, project deadline이 다음 주로 변경되었습니다. CEO가 직접 presentation을 review하고 feedback을 주기로 했으니 모든 team member들은 준비를 철저히 해주세요."
            ]
        }
    },
    {
        "topic": "Business",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "To stay competitive in this 시장, we really need to innovate our product line."
            ],
            "gpt-4.1-nano": [
                "Our team is working hard to meet the deadline, but we also need to 전략적으로 plan our next steps for the Korean 시장."
            ],
            "gpt-4.1-mini": [
                "We need to finalize the 계약 by next week to secure the client’s trust and move forward with the 프로젝트 smoothly."
            ],
            "claude-3.7-sonnet": [
                "After reviewing the quarterly sales figures, our team needs to 회의를 진행하다 (conduct a meeting) with the stakeholders to discuss our new 사업 전략 (business strategy) for the upcoming fiscal year. We should prepare all the necessary 자료 (materials) beforehand so we can make a strong case for increasing our marketing budget."
            ]
        }
    },
    {
        "topic": "Business",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "이번 프로젝트의 성공을 위해 team members와의 소통이 정말 중요해요. 그래서 우리는 weekly meeting을 통해 progress를 점검할 거예요."
            ],
            "gpt-4.1-nano": [
                "이번 프로젝트는 전략을 잘 세우는 것이 핵심이니까, 먼저 market analysis부터 시작하는 게 좋아요."
            ],
            "gpt-4.1-mini": [
                "이번 분기에는 market share를 늘리기 위해 새로운 전략을 도입하는 게 중요해요."
            ],
            "claude-3.7-sonnet": [
                "우리 회사가 새로운 project proposal을 준비해야 하는데, deadline이 다음 주 금요일이에요. 모든 team member들이 각자 맡은 부분을 complete 하고 final meeting에서 feedback을 주고받을 예정입니다."
            ]
        }
    },
    {
        "topic": "Business",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "In today's meeting, we need to discuss our marketing strategy. 마케팅 전략에 대해 논의하는 것이 아주 중요해요."
            ],
            "gpt-4.1-nano": [
                "Our company is expanding into new markets next quarter, so we need to update our strategy.  \n이번에는 시장 조사와 경쟁 분석이 매우 중요하니까, 모두 함께 힘내요."
            ],
            "gpt-4.1-mini": [
                "Our quarterly sales have exceeded expectations this year.  \n이번 분기 매출이 예상보다 훨씬 잘 나와서 팀 전체가 매우 기뻐하고 있어요."
            ],
            "claude-3.7-sonnet": [
                "The quarterly report shows significant growth in our Asia-Pacific market share. \n우리 회사의 새로운 마케팅 전략이 한국과 일본에서 특히 효과적이었습니다."
            ]
        }
    },
    {
        "topic": "Everyday Conversation",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Did you see that new 카페 down the street? I heard they have the best 커피!"
            ],
            "gpt-4.1-nano": [
                "Are you coming to the party tonight, or should I just meet you at the 카페 later?"
            ],
            "gpt-4.1-mini": [
                "Hey, do you want to grab some 커피 later and maybe catch a movie?"
            ],
            "claude-3.7-sonnet": [
                "I need to buy some 양파 and 마늘 for dinner tonight, and maybe we can stop by the 노래방 afterward if you're not too tired. Let's meet at the 카페 near your apartment around 6 o'clock."
            ]
        }
    },
    {
        "topic": "Everyday Conversation",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "오늘 저녁에 pizza 먹으러 갈래? 같이 가면 더 재밌을 것 같아!"
            ],
            "gpt-4.1-nano": [
                "오늘은 내가 새로운 project에 대해 이야기하고 싶어, 정말 exciting했어."
            ],
            "gpt-4.1-mini": [
                "오늘 저녁에 같이 movie 보러 갈래? 시간이 괜찮으면 알려줘!"
            ],
            "claude-3.7-sonnet": [
                "오늘 meeting 끝나고 같이 coffee shop 갈래요? 거기서 report 마무리하면서 새로운 project에 대해 이야기할 수 있어요."
            ]
        }
    },
    {
        "topic": "Everyday Conversation",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Did you see that 새로운 카페 that just opened downtown? I heard their 커피 is amazing!"
            ],
            "gpt-4.1-nano": [
                "Hey, I was thinking maybe we can meet up later and grab some 맛있는 dinner together."
            ],
            "gpt-4.1-mini": [
                "Hey, do you want to grab some 커피 마시러 가자 after work?"
            ],
            "claude-3.7-sonnet": [
                "I was supposed to meet Sarah for lunch, but she texted me saying \"잠시만 기다려주세요\" because she got stuck in traffic. When I finally saw her, I just said \"괜찮아요, 걱정 마세요\" and we went to that new restaurant near the park."
            ]
        }
    },
    {
        "topic": "Everyday Conversation",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "오늘 저녁에 movie 보러 가고 싶어요? "
            ],
            "gpt-4.1-nano": [
                "오늘은 친구랑 lunch schedule 잡았는데, 너무 기대돼서 지금부터 너무 excited해요."
            ],
            "gpt-4.1-mini": [
                "오늘 저녁에 같이 dinner 먹으러 갈래?  \n시간 괜찮으면 let me know!"
            ],
            "claude-3.7-sonnet": [
                "오늘 너무 busy day였어요, 아침부터 회의 세 개 참석하고 lunch break도 없이 계속 일했어요. 내일은 조금 take it easy하면서 work-life balance를 지켜야겠어요."
            ]
        }
    },
    {
        "topic": "Everyday Conversation",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Have you seen my keys anywhere?  \n아직 못 찾았으면, 내가 좀 더 찾아볼게."
            ],
            "gpt-4.1-nano": [
                "Are you going to the grocery store later? 오늘은 뭐 살지 고민되고 있어."
            ],
            "gpt-4.1-mini": [
                "What time do you want to meet for coffee?  \n몇 시에 카페에서 만날래?"
            ],
            "claude-3.7-sonnet": [
                "I need to get some groceries for dinner tonight. \n오늘 저녁에 친구들이 우리 집에 놀러 올 거라서 맛있는 음식을 준비해야 해요."
            ]
        }
    },
    {
        "topic": "Language Education",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Learning a new 언어 can be challenging, but with the right 방법, it becomes much easier and even fun!"
            ],
            "gpt-4.1-nano": [
                "Learning a new language can be challenging, but 꾸준히 연습하면 정말 좋아져요."
            ],
            "gpt-4.1-mini": [
                "When teaching vocabulary, it's helpful to use 그림 flashcards so students can associate words with images more easily."
            ],
            "claude-3.7-sonnet": [
                "Learning a new 언어 requires consistent practice and exposure to authentic materials, which is why our language institute offers immersive 수업 with native speakers who can guide students through the complexities of grammar and pronunciation."
            ]
        }
    },
    {
        "topic": "Language Education",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "요즘 학생들이 online 수업을 많이 듣는데, 이게 정말 language learning에 도움이 되는 것 같아요."
            ],
            "gpt-4.1-nano": [
                "학생들은 매일 English practice가 중요하다고 생각해요, 그래서 저희는 다양한 방법으로 learning을 돕고 있어요."
            ],
            "gpt-4.1-mini": [
                "요즘 학생들은 language skills를 키우기 위해 다양한 online resources를 활용하고 있어요."
            ],
            "claude-3.7-sonnet": [
                "저는 language center에서 일주일에 세 번 Korean class를 듣고 있어요. 선생님께서 매일 homework를 내주시지만 vocabulary 공부하는 것이 재미있어서 괜찮아요."
            ]
        }
    },
    {
        "topic": "Language Education",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "To really master a new language, you have to 많이 연습하다 and not be afraid to make mistakes."
            ],
            "gpt-4.1-nano": [
                "Learning a new language is truly rewarding, especially when you start to think in 그 언어 naturally."
            ],
            "gpt-4.1-mini": [
                "When teaching vocabulary, it's helpful to use 단어 카드 so students can memorize more effectively."
            ],
            "claude-3.7-sonnet": [
                "I always tell my students that 언어 공부 (language study) requires daily practice, and they should try to 새로운 표현 배우기 (learn new expressions) whenever possible. Even just spending 십오 분 (fifteen minutes) each day on vocabulary can significantly improve their 한국어 실력 (Korean proficiency) over time."
            ]
        }
    },
    {
        "topic": "Language Education",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "외국어를 배우는 것은 정말 중요한데, 특히 communication skills를 향상시키는 데 큰 도움이 돼요."
            ],
            "gpt-4.1-nano": [
                "언어를 배우는 것은 정말 중요한데, especially for 글로벌 communication, 그래서 꾸준히 practice하는 게 중요해요."
            ],
            "gpt-4.1-mini": [
                "요즘은 language learning이 정말 중요해서 매일 조금씩 practice 하는 게 좋아요."
            ],
            "claude-3.7-sonnet": [
                "요즘 language learning apps을 사용해서 외국어를 배우는 게 trend가 되었는데, 진짜 fluency를 얻으려면 native speakers와 자주 practice하는 것이 best approach라고 생각해요. 효과적인 언어 학습을 위해서는 grammar rules만 외우지 말고 real-life conversations에 참여하는 것이 중요합니다."
            ]
        }
    },
    {
        "topic": "Language Education",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Learning a new language opens doors to understanding different cultures. 그래서 다양한 언어를 배우는 것은 정말 중요해요."
            ],
            "gpt-4.1-nano": [
                "Learning a new language can be challenging, but 꾸준히 연습하면 금방 익숙해질 거예요.  \nBy practicing every day, you'll gradually improve your speaking and listening skills."
            ],
            "gpt-4.1-mini": [
                "Effective language education requires both practice and immersion.  \n그래서 매일 영어로 대화하는 게 정말 중요해요."
            ],
            "claude-3.7-sonnet": [
                "Learning a new language opens doors to different cultures and opportunities around the world. 새로운 언어를 배우는 것은 시간과 인내가 필요하지만, 꾸준한 연습과 실제 대화를 통해 실력이 빠르게 향상될 수 있습니다."
            ]
        }
    },
    {
        "topic": "Entertainment",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "I just watched the latest 드라마, and the plot twist at the end was so unexpected!"
            ],
            "gpt-4.1-nano": [
                "Did you see the new 영화 that just came out? It’s supposed to be 정말 amazing."
            ],
            "gpt-4.1-mini": [
                "I can’t wait for the new 영화 to drop next week; the trailer looks 정말 amazing!"
            ],
            "claude-3.7-sonnet": [
                "I was so excited to watch the new 드라마 on Netflix last night, but my 언니 already spoiled the ending for me during our phone call. The 배우 who plays the main character is so talented, I've been a huge 팬 since his debut movie!"
            ]
        }
    },
    {
        "topic": "Entertainment",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "요즘 Netflix에서 새로운 series가 많이 나와서 정말 재미있어요. 특히 그 show는 완전 대박이에요!"
            ],
            "gpt-4.1-nano": [
                "이번 주말에 Netflix에서 새로운 series를 볼 생각인데, 너도 함께 볼래?"
            ],
            "gpt-4.1-mini": [
                "이번 주말에 새로 나온 movie 보러 갈래? 정말 기대돼!"
            ],
            "claude-3.7-sonnet": [
                "요즘 넷플릭스에서 새로운 drama를 binge-watching 중인데, 너무 addictive해서 밤새 다 봤어요. 친구들이랑 weekend에 모여서 popcorn 먹으면서 premiere 파티를 하기로 했어요."
            ]
        }
    },
    {
        "topic": "Entertainment",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "I just watched the latest 드라마, and it was 정말 재밌었어!"
            ],
            "gpt-4.1-nano": [
                "Did you see that new movie? 완전 너무 재밌어서, I couldn't stop 웃었어."
            ],
            "gpt-4.1-mini": [
                "I can't wait for the new 드라마 to come out next week; the storyline looks 정말 흥미진진!"
            ],
            "claude-3.7-sonnet": [
                "I just watched the latest 드라마 on Netflix, and 진짜 재미있어요 because the plot twists kept me on the edge of my seat. The main actor's 연기력 was so impressive that I couldn't help but 팬이 되었어요 after just one episode."
            ]
        }
    },
    {
        "topic": "Entertainment",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "요즘 Netflix에서 정말 재미있는 show가 많이 올라왔어요. 특히 그 드라마는 plot twist가 정말 대박이에요!"
            ],
            "gpt-4.1-nano": [
                "이번 새로 나온 드라마 정말 대박이야, the storyline가 너무 흥미로워서 계속 binge watching하게 돼."
            ],
            "gpt-4.1-mini": [
                "요즘에 새로운 movie가 너무 재밌어서 weekend에 친구들이랑 같이 보러 갈 거야."
            ],
            "claude-3.7-sonnet": [
                "요즘 Netflix에서 새로운 K-drama가 release 됐는데, 정말 binge-worthy하고 plot twist가 많아서 완전 addicted 됐어요. 친구들이랑 watch party 하면서 주말 내내 marathon 했는데, 마지막 episode에서 너무 shocked 해서 다음 시즌이 빨리 나오길 기다리고 있어요."
            ]
        }
    },
    {
        "topic": "Entertainment",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "I can't wait to watch the new K-drama this weekend. 주말에 그 새로운 K-드라마를 보는 게 정말 기대돼!"
            ],
            "gpt-4.1-nano": [
                "Did you watch the latest episode of that new K-drama?  \n이번 시즌의 결말이 정말 충격적이었어요, 진짜 대박이었어요."
            ],
            "gpt-4.1-mini": [
                "The new Marvel movie is getting amazing reviews.  \n이번 주말에 같이 보러 갈래?"
            ],
            "claude-3.7-sonnet": [
                "Netflix has released several hit Korean dramas that have gained global popularity in recent years. \n넷플릭스의 '오징어 게임'은 전 세계적으로 엄청난 성공을 거두었고 한국 엔터테인먼트의 영향력을 보여주었습니다."
            ]
        }
    },
    {
        "topic": "Slang/Neologisms",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Have you heard the latest 유행어 about that new app? Everyone’s saying it’s totally 대박!"
            ],
            "gpt-4.1-nano": [
                "Honestly, that new 앱 is so lit, I can't stop using it every day, 제 인생 완전 바뀌었어."
            ],
            "gpt-4.1-mini": [
                "That new app is totally 대박, everyone’s talking about how it’s changed the 게임 completely."
            ],
            "claude-3.7-sonnet": [
                "That new Netflix show is totally 대박 - I stayed up all night binge-watching it and now I'm completely 꿀잼 because the storyline was so addictive."
            ]
        }
    },
    {
        "topic": "Slang/Neologisms",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "요즘 친구들이 자주 쓰는 slang이 너무 funny해서, 나도 따라 해보려고 해. 특히 \"lit\" 이라는 단어가 정말 cool해!"
            ],
            "gpt-4.1-nano": [
                "요즘은 그 친구가 완전 chill한 vibe를 가지고 있어서, 만날 때마다 기분이 좋아져."
            ],
            "gpt-4.1-mini": [
                "요즘 친구들이 “핵 cool”이라고 하면 진짜 멋있다는 뜻이야. 그거 완전 new slang이라서 나도 따라 쓰고 있어!"
            ],
            "claude-3.7-sonnet": [
                "요즘 young한 세대들은 flex하는 걸 좋아해서 SNS에 인생샷을 많이 올려요. 그들은 자기가 얼마나 hype한지 보여주는 걸 flex라고 부르는데, 이런 trend는 계속 growing하고 있어요."
            ]
        }
    },
    {
        "topic": "Slang/Neologisms",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Have you heard the latest slang? It’s so 대박 when something unexpected happens!"
            ],
            "gpt-4.1-nano": [
                "Hey, did you see that new meme? It's so lit, 완전 대박이야!"
            ],
            "gpt-4.1-mini": [
                "Have you heard the new slang “인싸”? It’s like calling someone the ultimate insider in the group."
            ],
            "claude-3.7-sonnet": [
                "When my friend saw my new outfit, she said \"완전 찐이다!\" which is basically their way of saying it's super cool and authentic. I've been trying to learn all these 신조어 (new slang words) that Korean teenagers use on social media, but it's hard to keep up with how quickly they 유행한다 (become trendy)."
            ]
        }
    },
    {
        "topic": "Slang/Neologisms",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "요즘 젊은 사람들은 진짜 vibe가 중요하다고 생각해요. 그래서 친구들이랑 hang out 할 때는 항상 좋은 분위기를 유지하려고 해요."
            ],
            "gpt-4.1-nano": [
                "요즘 신조어 너무 헷갈리는데, 그냥 트렌드 따라가는 게 제일인 것 같아, you know?"
            ],
            "gpt-4.1-mini": [
                "요즘 친구들이 너무 cool해서 나도 좀 vibe 맞추려고 노력 중이야."
            ],
            "claude-3.7-sonnet": [
                "요즘 애들은 진짜 glow up 했는데, 솔직히 flex하는 거 보면 cringe해. 그냥 humble하게 있으면 안 되나, 자꾸 lowkey flex 하는데 솔직히 mood killer야."
            ]
        }
    },
    {
        "topic": "Slang/Neologisms",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Have you heard the latest slang that everyone's using? 요즘 젊은 사람들 사이에서 '짤'이라는 단어가 엄청 유행하고 있어!"
            ],
            "gpt-4.1-nano": [
                "I just saw a new TikTok trend, and people are calling it \"simp\" overload. 진짜 요즘은 \"찐\"이란 말도 엄청 많이 쓰더라구요."
            ],
            "gpt-4.1-mini": [
                "Have you heard the new slang \"핵인싸\"?  \n요즘 젊은 사람들 사이에서 완전 인기 있는 말이에요."
            ],
            "claude-3.7-sonnet": [
                "Nowadays, \"ghosting\" someone has become a common term for suddenly cutting off all communication without explanation.\n요즘 SNS에서 갑자기 연락 두절하는 걸 \"잠수 타다\"라고 하는데, 진짜 당하면 너무 속상하더라고."
            ]
        }
    },
    {
        "topic": "Travel",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "I can't wait to explore the 아름다운 beaches in Busan during my trip!"
            ],
            "gpt-4.1-nano": [
                "I'm planning my next trip to Paris, and I can't wait to see the 아름다운 sights and try some authentic croissants."
            ],
            "gpt-4.1-mini": [
                "I’m so excited to visit 서울 next month and try all the 맛있는 street food there!"
            ],
            "claude-3.7-sonnet": [
                "When we arrived at the 공항 (airport), I realized I had forgotten my 여권 (passport) at the hotel, so we had to take a 택시 (taxi) back to get it before our 비행기 (airplane) departed."
            ]
        }
    },
    {
        "topic": "Travel",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "이번 여행에서 가장 기대되는 것은 beautiful scenery와 delicious food이에요."
            ],
            "gpt-4.1-nano": [
                "이번 여행에서 꼭 가보고 싶은 place는 유명한 museum이야."
            ],
            "gpt-4.1-mini": [
                "이번 여행은 정말 amazing했어, especially 그 beach에서 sunset 보는 순간이 최고였어."
            ],
            "claude-3.7-sonnet": [
                "저는 다음 주에 beach vacation을 위해 제주도에 가는데, 특히 local food를 맛보고 sunset을 감상하는 것이 정말 기대돼요. 호텔 booking은 이미 완료했고 rental car도 예약했어요."
            ]
        }
    },
    {
        "topic": "Travel",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "I'm so excited to 여행하고 싶어 to Japan next month and try all the delicious 음식 there!"
            ],
            "gpt-4.1-nano": [
                "I'm planning a trip to Seoul next month, and I can't wait to explore the 아름다운 sights and 맛있는 food."
            ],
            "gpt-4.1-mini": [
                "When you visit Seoul, don’t forget to try some 진짜 맛있는 street food like tteokbokki and hotteok."
            ],
            "claude-3.7-sonnet": [
                "I'm planning to 제주도로 여행 가다 next month because I heard the beaches are beautiful and 음식이 정말 맛있어요. Before I leave, I need to 호텔을 예약하다 and make sure I have enough 현금 for the local markets."
            ]
        }
    },
    {
        "topic": "Travel",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "이번 여름에 여행을 가고 싶은데, I really want to visit 제주도."
            ],
            "gpt-4.1-nano": [
                "여행 가기 전에 꼭 packing list를 다시 한 번 check하고 있어요."
            ],
            "gpt-4.1-mini": [
                "이번 여름에는 꼭 beach vacation 가고 싶어요, 스트레스 풀기에 딱 좋잖아요."
            ],
            "claude-3.7-sonnet": [
                "다음 주에 Jeju Island로 family trip을 가는데, 제주도의 beautiful beaches와 delicious seafood를 정말 기대하고 있어요. 친구가 추천한 travel itinerary를 follow하면서 local attractions도 많이 방문할 계획이에요."
            ]
        }
    },
    {
        "topic": "Travel",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Traveling to new countries is always an exciting adventure. 이번 여름에는 일본에 가고 싶어요!"
            ],
            "gpt-4.1-nano": [
                "I'm planning to visit Paris next summer to see the Eiffel Tower. 프랑스 여행이 기대돼서 벌써부터 가슴이 설레요."
            ],
            "gpt-4.1-mini": [
                "I can’t wait to explore the beautiful beaches in 제주도 this summer.  \n거기 가면 신선한 해산물도 꼭 먹어야 해요."
            ],
            "claude-3.7-sonnet": [
                "I'm planning to visit Seoul next summer for a food tour and cultural experience. \n서울에서 유명한 명동과 경복궁을 방문할 계획이고, 현지 음식도 많이 맛볼 거예요."
            ]
        }
    },
    {
        "topic": "Software Development",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "When I'm debugging my 코드, I often find that a fresh perspective helps me see the 문제 more clearly."
            ],
            "gpt-4.1-nano": [
                "During the debugging session, I noticed that the variable 이름 wasn’t updating properly, so I had to 재할당 it to fix the bug."
            ],
            "gpt-4.1-mini": [
                "When debugging the 코드, make sure to check the 변수 names carefully to avoid any unexpected errors."
            ],
            "claude-3.7-sonnet": [
                "During our daily 스크럼 meeting, I mentioned that we need to fix the critical 버그 in the payment system before we can deploy the new release to the 서버. Our senior 개발자 agreed to review my code changes this afternoon so we can meet the deadline."
            ]
        }
    },
    {
        "topic": "Software Development",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "이번 프로젝트에서는 new feature를 구현해야 해. 코드 리뷰를 통해 quality를 높이는 것도 잊지 마!"
            ],
            "gpt-4.1-nano": [
                "이번 프로젝트에서 중요한 것은 bugs를 미리 발견하는 것이니까, debugging 과정을 꼼꼼하게 해보는 게 좋아요."
            ],
            "gpt-4.1-mini": [
                "이번 Sprint에서 새로운 feature를 implement하는 데 집중할 거고, 특히 API integration 부분을 강화할 계획이야."
            ],
            "claude-3.7-sonnet": [
                "우리 팀은 새로운 software를 개발하기 위해 agile methodology를 사용하고 있어요. Sprint planning 미팅에서 각 developer가 자신의 task를 선택하고 deadline까지 완성하기 위해 최선을 다하고 있습니다."
            ]
        }
    },
    {
        "topic": "Software Development",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "When developing software, it's important to 사용자가 원하는 기능을 정확하게 이해하다 to ensure a great user experience."
            ],
            "gpt-4.1-nano": [
                "When debugging the code, I realized I forgot to handle the null case in the 함수, so the app crashes randomly."
            ],
            "gpt-4.1-mini": [
                "When debugging, it’s important to 먼저 문제를 정확히 파악하다 before jumping into the 코드."
            ],
            "claude-3.7-sonnet": [
                "When our team had to debug the 복잡한 코드 (complex code) last night, we stayed at the office 밤을 새우면서 (pulling an all-nighter) to fix all the critical issues before the morning deployment."
            ]
        }
    },
    {
        "topic": "Software Development",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "새로운 프로젝트를 위해서 agile methodology를 적용하는 게 중요해요. 그러면 팀의 productivity가 높아질 거예요."
            ],
            "gpt-4.1-nano": [
                "이번 프로젝트에서는 API를 잘 설계하는 것이 중요해서, careful planning이 필요해요."
            ],
            "gpt-4.1-mini": [
                "이번 프로젝트는 agile methodology를 적용해서 빠르게 develop하고, regular로 code review 하는 게 중요해요."
            ],
            "claude-3.7-sonnet": [
                "새로운 feature를 implement하기 위해 우리 팀은 agile methodology를 따라 sprint planning meeting을 진행했어요. 개발자들이 각자 task를 맡아 code review를 철저히 하면서 project timeline 안에 모든 deliverables를 완성하기로 했습니다."
            ]
        }
    },
    {
        "topic": "Software Development",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "In software development, understanding algorithms is crucial for optimizing performance. 그래서 알고리즘을 잘 이해하면 더 효율적인 코드를 작성할 수 있어요."
            ],
            "gpt-4.1-nano": [
                "We need to optimize the algorithm to improve performance. 이 프로세스는 코드 리뷰와 테스트를 통해 더 안정적으로 만들 수 있어요."
            ],
            "gpt-4.1-mini": [
                "Debugging is an essential part of the software development process.  \n코드를 꼼꼼히 살펴보면서 문제를 찾는 게 정말 중요해요."
            ],
            "claude-3.7-sonnet": [
                "Agile development helps teams respond quickly to changing requirements and deliver value continuously. 애자일 개발 방법론에서는 스프린트 계획, 데일리 스크럼, 그리고 회고 미팅이 팀의 효율성을 높이는 핵심 요소입니다."
            ]
        }
    },
    {
        "topic": "Health & Wellness",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "To maintain good 건강, make sure you drink plenty of 물 and get enough sleep every night."
            ],
            "gpt-4.1-nano": [
                "Remember to stay hydrated, and don't forget to include enough 채소 in your diet for overall 건강."
            ],
            "gpt-4.1-mini": [
                "To boost your 면역력, make sure to eat plenty of vegetables and get enough 수면 every night."
            ],
            "claude-3.7-sonnet": [
                "I always start my morning with a glass of 물 and some gentle 스트레칭 to improve my 건강 before heading to the gym. After my workout, I like to make a nutritious 샐러드 with lots of 채소 to help my body recover."
            ]
        }
    },
    {
        "topic": "Health & Wellness",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "건강을 위해서 매일 exercise 하는 게 중요해요. 그리고 충분한 sleep도 꼭 챙겨야 해요!"
            ],
            "gpt-4.1-nano": [
                "나는 오늘 morning jog을 하고 왔는데, 정말 기분이 so good였어."
            ],
            "gpt-4.1-mini": [
                "운동할 때는 proper 자세가 정말 중요하고, 충분한 water 섭취도 잊지 마세요."
            ],
            "claude-3.7-sonnet": [
                "아침에 가볍게 jogging 하고 healthy 아침 식사를 하면 하루 종일 energy가 넘칠 거예요. 또한 regular 운동과 balanced 식단은 당신의 mental health에도 좋은 영향을 미칠 수 있습니다."
            ]
        }
    },
    {
        "topic": "Health & Wellness",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "To stay healthy, it's important to 꾸준히 운동하다 and eat a balanced diet."
            ],
            "gpt-4.1-nano": [
                "Remember to stay hydrated and get enough sleep, because 건강이 최우선이니까."
            ],
            "gpt-4.1-mini": [
                "To stay 건강하게, it’s important to get enough 수면 and eat balanced meals every day."
            ],
            "claude-3.7-sonnet": [
                "After my intense 아침 운동 (morning workout), I always make sure to drink plenty of water and eat a balanced breakfast with 건강한 음식 (healthy food) to maintain my energy throughout the day."
            ]
        }
    },
    {
        "topic": "Health & Wellness",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "건강을 유지하려면 balanced diet와 regular exercise가 정말 중요해요. 스트레스를 줄이기 위해 meditation도 시도해보세요!"
            ],
            "gpt-4.1-nano": [
                "몸 건강을 유지하려면 꾸준한 exercise와 좋은 nutrition이 정말 중요해요."
            ],
            "gpt-4.1-mini": [
                "건강을 위해서는 매일 30분씩 exercise 하는 게 정말 중요해요. 몸과 마음 모두가 happy해질 거예요."
            ],
            "claude-3.7-sonnet": [
                "건강을 유지하려면 매일 at least 30 minutes 동안 운동하고 balanced diet를 챙겨 먹는 것이 중요해요. 스트레스 관리를 위해 가끔 take a break하고 self-care time을 가지는 것도 잊지 마세요."
            ]
        }
    },
    {
        "topic": "Health & Wellness",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Staying active is essential for maintaining good health. 그래서 매일 30분씩 운동하는 것이 좋아요."
            ],
            "gpt-4.1-nano": [
                "Regular exercise can boost your mood and energy levels throughout the day. 그래서 매일 30분씩 걷거나 가볍게 운동하는 습관을 들이세요."
            ],
            "gpt-4.1-mini": [
                "Staying hydrated is key to maintaining good health.  \n물을 충분히 마시는 것이 몸에 정말 중요해요."
            ],
            "claude-3.7-sonnet": [
                "Regular exercise is essential for maintaining both physical and mental health.\n건강한 식습관과 충분한 수면도 웰빙을 위한 중요한 요소입니다."
            ]
        }
    },
    {
        "topic": "Academic",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "In our 수업 today, we discussed the importance of critical thinking in academic research. It's essential to develop 좋은 질문 that can lead to deeper insights."
            ],
            "gpt-4.1-nano": [
                "In my research, I found that the key concept is 바로 \"collaboration\" between different 학문 fields to solve complex 문제."
            ],
            "gpt-4.1-mini": [
                "For my research paper, I need to analyze the 데이터를 carefully before drawing any conclusions."
            ],
            "claude-3.7-sonnet": [
                "I need to finish my 논문 by tomorrow, but I haven't even started the literature 연구 section yet. The professor said our final 성적 depends heavily on this assignment, so I should probably cancel my plans tonight."
            ]
        }
    },
    {
        "topic": "Academic",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "이번 semester에 제가 수업에서 배운 새로운 concepts는 정말 흥미로웠어요."
            ],
            "gpt-4.1-nano": [
                "이번 semester에 우리가 배우는 main concept는 critical thinking과 논리적 reasoning이에요."
            ],
            "gpt-4.1-mini": [
                "이번 학기에는 research paper를 작성해야 해서 자료 조사하는 데 시간이 많이 걸렸어요."
            ],
            "claude-3.7-sonnet": [
                "오늘 우리 research team이 새로운 project를 시작했는데, 모든 data를 분석하고 deadline까지 report를 제출해야 해요. 교수님께서 feedback을 주실 때까지 우리는 library에서 reference 자료를 더 찾아볼 계획이에요."
            ]
        }
    },
    {
        "topic": "Academic",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "To succeed in this research project, we must 먼저 데이터를 분석해야 해."
            ],
            "gpt-4.1-nano": [
                "To improve your understanding, you should 적극적으로 participate in class discussions and review your notes 매일."
            ],
            "gpt-4.1-mini": [
                "For my thesis, I have to analyze the 데이터 carefully to draw meaningful conclusions."
            ],
            "claude-3.7-sonnet": [
                "I'm really stressed about my 기말 고사 next week, so I need to prepare my 발표 자료 and review all the lecture notes tonight. If I don't get at least a B+ in this class, my parents will be disappointed with my 성적표 again."
            ]
        }
    },
    {
        "topic": "Academic",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "이번 프로젝트를 위해 우리는 data 분석을 철저히 해야 해요."
            ],
            "gpt-4.1-nano": [
                "이번 프로젝트에서 teamwork이 정말 중요하니까, 모두 최선을 다해서 협력해야 해요."
            ],
            "gpt-4.1-mini": [
                "이번 학기에는 research paper를 쓰는 게 정말 중요한 과제 중 하나예요. 그래서 매일 library에서 자료를 찾으면서 집중해서 work 해야 해요."
            ],
            "claude-3.7-sonnet": [
                "이번 semester 동안 research paper를 세 개 작성해야 하는데, deadline이 너무 빡빡해서 걱정이에요. 교수님께 extension을 요청할까 고민 중인데, 다른 classmates도 같은 상황인지 물어봐야겠어요."
            ]
        }
    },
    {
        "topic": "Academic",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Studying different cultures enhances our understanding of global issues. 그래서 다양한 문화에 대한 연구는 매우 중요해요."
            ],
            "gpt-4.1-nano": [
                "Understanding complex theories is essential for my research, so I spend hours reviewing academic journals.  \n이론을 깊이 있게 파악하는 것이 연구에 매우 중요해서 매일 논문을 읽는 습관이 있어요."
            ],
            "gpt-4.1-mini": [
                "The professor emphasized the importance of critical thinking in research.  \n연구를 할 때는 비판적 사고가 정말 중요하다고 하셨어요."
            ],
            "claude-3.7-sonnet": [
                "The professor emphasized the importance of critical thinking in academic research. \n학생들은 논문을 쓸 때 다양한 관점에서 문제를 분석하는 능력을 개발해야 합니다."
            ]
        }
    },
    {
        "topic": "Traditional Culture",
        "cs_level": "word",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "In 한국, traditional festivals like Chuseok celebrate the harvest with family and delicious 음식, showcasing the beauty of cultural heritage."
            ],
            "gpt-4.1-nano": [
                "In our traditional festival, we wear 한복 and celebrate the rich cultural 유산 of Korea."
            ],
            "gpt-4.1-mini": [
                "When visiting Korea, you should definitely try wearing a 한복 to experience the traditional culture fully."
            ],
            "claude-3.7-sonnet": [
                "During Chuseok, we gathered with our 가족 to prepare traditional 떡 and share stories about our ancestors while wearing colorful 한복 for the celebration. The 할머니 taught the children how to perform a proper 절 to show respect during the ancestral 제사 ceremony."
            ]
        }
    },
    {
        "topic": "Traditional Culture",
        "cs_level": "word",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "한국의 전통 문화는 정말 fascinating해요, 특히 한복과 같은 의상은 아름다움의 상징이에요."
            ],
            "gpt-4.1-nano": [
                "한국의 traditional 의상인 한복은 정말 아름다워요, 특히 그 디자인과 fabric이 정말 unique하죠."
            ],
            "gpt-4.1-mini": [
                "한국의 전통 hanbok은 정말 아름답고, 특별한 occasion에 입으면 더 의미가 있어요."
            ],
            "claude-3.7-sonnet": [
                "우리 할머니는 매주 일요일에 traditional 한복을 입고 family gathering에 참석하시는데, 특히 명절 때는 항상 authentic 한국 음식을 직접 만드셔서 우리에게 heritage의 중요성을 가르쳐 주세요. 젊은 세대들이 cultural roots를 잊지 않도록 노력하시는 모습이 정말 감동적이에요."
            ]
        }
    },
    {
        "topic": "Traditional Culture",
        "cs_level": "phrase",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "The beauty of 우리의 전통 문화 is truly inspiring, especially during festivals when everyone comes together to celebrate."
            ],
            "gpt-4.1-nano": [
                "Exploring traditional dance is fascinating, especially when I learn the 역사와 문화 behind each move."
            ],
            "gpt-4.1-mini": [
                "When visiting Korea, you definitely have to try on a 한복 and experience the beauty of traditional culture firsthand."
            ],
            "claude-3.7-sonnet": [
                "During Chuseok, we always 가족과 함께 모여서 송편을 만들어요, and it's my favorite time to connect with our ancestral traditions. The elders tell stories about 옛날 생활 방식 while we prepare the traditional feast with 정성을 담아 만든 음식."
            ]
        }
    },
    {
        "topic": "Traditional Culture",
        "cs_level": "phrase",
        "major_lang": "Korean",
        "scripts": {
            "gpt-4o-mini": [
                "한국의 전통 문화는 정말 fascinating 해요, 특히 한복과 같은 의상은 그 아름다움이 특별하죠. 또한, 명절에는 family gathering이 있어 더욱 의미가 깊어요."
            ],
            "gpt-4.1-nano": [
                "한국 전통 의상인 hanbok은 정말 아름다워서, 꼭 한번 wearing it 경험해봐야 해요."
            ],
            "gpt-4.1-mini": [
                "한국 전통 문화에서는 한복을 입고 traditional ceremonies에 참여하는 것이 중요한 의미를 가져요."
            ],
            "claude-3.7-sonnet": [
                "한국의 traditional performance art인 판소리는 한 명의 vocalist와 고수라 불리는 drummer가 함께하는 special art form이에요. 이 문화유산은 UNESCO World Heritage로 등재되어 있어서 많은 international tourists들이 authentic Korean culture를 experience하기 위해 공연을 보러 와요."
            ]
        }
    },
    {
        "topic": "Traditional Culture",
        "cs_level": "sentence",
        "major_lang": "English",
        "scripts": {
            "gpt-4o-mini": [
                "Traditional music plays a vital role in preserving cultural heritage. 한국의 전통 음악은 우리의 역사와 정체성을 이해하는 데 큰 도움이 돼요."
            ],
            "gpt-4.1-nano": [
                "Traditional hanbok fashion has been passed down through generations, showcasing Korea’s rich cultural heritage.  \n한복의 아름다움과 그 의미를 이해하는 것이 정말 중요하다고 생각해요."
            ],
            "gpt-4.1-mini": [
                "Traditional hanbok designs are inspired by nature and seasons.  \n한국 전통 문화에서는 이런 자연과 계절의 변화가 아주 중요한 의미를 가지고 있어요."
            ],
            "claude-3.7-sonnet": [
                "Traditional Korean hanbok is known for its vibrant colors and elegant design that reflects Korea's rich cultural heritage. 전통 한복을 입고 설날이나 추석 같은 명절에 세배를 드리는 것은 한국 문화의 아름다운 관습입니다."
            ]
        }
    }
]